# Make sure apps get installed in system Applications dir
cask_args appdir: '/Applications'

# Taps
tap 'caskroom/versions' # Only used for parallels-desktop11.
tap 'caskroom/fonts'

# Basics
cask 'adobe-creative-cloud' # installer dl
cask 'backblaze' # installer dl
# cask 'dropbox' # stopped using Dropbox
cask 'google-drive'
mas  '1Password', id: 443987910
# DL: ?Screens Connect

# Apple
mas  'iMovie', id: 408981434
mas  'Pages', id: 775737590
mas  'Keynote', id: 409183694

# Work
cask 'atom'
cask 'hyper'
cask 'sketch'
cask 'coda'
cask 'framer'
cask 'google-chrome'
cask 'github-desktop'
mas  'iA Writer', id: 775737590
mas  'Icon Slate', id: 439697913
# cask 'origami-studio'
# cask 'parallels-desktop' # Installs Parallels 12 and I only own 11.
cask 'parallels-desktop11'
mas  'Pixelmator', id: 407963104
cask 'postman'
mas  'Todoist', id: 585829637
mas  'Xcode', id: 497799835 # This one takes a long time to download and install.
# DL: Adobe Creative Cloud: LR ID AI PS

# Utilities
cask 'appcleaner'
mas  'Deliveries', id: 924726344
brew 'ffmpeg', args: ['with-libvorbis', 'with-libvpx']
brew 'gpg' # For GitHub commit signing.
brew 'gpg-agent' # To prevent GitHub commit signing from requiring password.
cask 'handbrake'
cask 'imageoptim'
mas  'iStat Mini', id: 927292435
mas  'Kaleidoscope', id: 587512244
cask 'kap'
cask 'keepingyouawake'
cask 'keka'
cask 'keybase'
brew 'pinentry-mac' # To prevent GitHub commit signing from requiring password.
mas  'PiPifier', id: 1160374471
brew 'p7zip'
cask 'qlmarkdown'
cask 'quitter'
cask 'timely'
mas  'Sip', id: 507257563
mas  'SmileAllDay', id: 1180442868
brew 'sl'
cask 'the-unarchiver'
cask 'transmission'
cask 'vlc'
brew 'youtube-dl'

# Communication
mas  'Tweetbot', id: 557168941
mas  'Slack', id: 803453959
# cask 'steam'

# Fonts
cask 'font-work-sans'
cask 'font-open-sans'
cask 'font-opendyslexic'
cask 'font-roboto-mono'
