# Make sure apps get installed in system Applications dir
cask_args appdir: '/Applications'

# Taps
tap 'homebrew/cask-fonts'

# Basics
cask 'adobe-creative-cloud' # installer dl
cask 'backblaze' # installer dl
cask 'dropbox'
cask '1password'

# Apple
mas  'iMovie', id: 408981434
mas  'Pages', id: 409201541
mas  'Keynote', id: 409183694

# Work
cask 'brave-browser'
cask 'coda'
cask 'docker'
cask 'framer'
cask 'figma'
cask 'google-chrome'
cask 'hyper'
cask 'firefox'
mas  'iA Writer', id: 775737590
mas  'Icon Slate', id: 439697913
cask 'notion'
cask 'parallels'
mas  'Pixelmator', id: 407963104
cask 'postman'
cask 'sketch'
mas  'Spark', id: 1176895641
cask 'toggl'
cask 'transmit'
cask 'visual-studio-code'
# mas  'Xcode', id: 497799835 # This one takes a long time to download and install.
# DL: Adobe Creative Cloud: LR CC, XD, ID, AI, PS

# Utilities
cask 'appcleaner'
cask 'bartender'
mas  'Deliveries', id: 924726344
cask 'expressvpn'
brew 'ffmpeg'
cask 'gpg-suite' # For GitHub commit signing.
cask 'handbrake'
cask 'imageoptim'
mas  'iStat Mini', id: 927292435
mas  'Kaleidoscope', id: 587512244
cask 'kap'
cask 'keepingyouawake'
cask 'keka'
cask 'keybase'
cask 'nosleep'
mas  'PiPifier', id: 1160374471
brew 'p7zip'
cask 'qlmarkdown'
cask 'quitter'
cask 'sip'
mas  'SmileAllDay', id: 1180442868
brew 'sl'
cask 'the-unarchiver'
cask 'transmission'
cask 'vlc'
brew 'youtube-dl'
mas  '1Blocker', id: 1107421413

# Communication
mas  'Tweetbot', id: 1384080005
mas  'Slack', id: 803453959
cask 'spotify'
cask 'zoomus'

# Fonts
#cask 'font-ibm-plex'
cask 'font-open-sans'
cask 'font-opendyslexic'
cask 'font-roboto-mono'
cask 'font-work-sans'
